// 转义特殊字符
export const unescapeSpecialChars = (content) => {
    const escapeMap = [
        [/\\=/g, '='], // 转义等号
        // [/\\/g, '\\'], // 转义反斜杠
        [/\\\`/g, '`'],   // 转义反引号
        [/\\\*/g, '*'],  // 转义星号
        [/\\\\\*/g, '\\*'],  // 转义星号
        [/\\\\n/g, '\\n'],  // 转义换行
        [/\\\[/g, '['],  // 转义左方括号
        [/\\\]/g, ']'],  // 转义右方括号
        [/\\\</g, '<'],  // 转义左方尖括号
        [/\\\>/g, '>'],  // 转义右方尖括号
        // [/\(/g, '('],  // 转义左括号
        // [/\)/g, ')'],  // 转义右括号
        // [/#/g, '#'],   // 转义井号
        [/\\\+/g, '+'],  // 转义加号
        [/\\\-/g, '-'],   // 转义减号
        // [/</g, '&lt;'],  // 转义小于号
        // [/>/g, '&gt;'],  // 转义大于号
        [/\\\_/g, '_'],   // 转义下划线
        // [/\{/g, '{'],  // 转义左花括号
        // [/\}/g, '}'],  // 转义右花括号
        // [/\|/g, '|'],  // 转义竖线
        // [/\$/g, '$'],  // 转义美元符号
        // [/\./g, '.'],  // 转义点号
        // [/!/g, '!'],   // 转义感叹号
    ];

    return escapeMap.reduce((acc, [regex, replacement]) => {
        return acc.replace(regex, replacement);
    }, content);
}
